Repository: 88hitman/ready
Catalog: packages/ready_validation/lib/l10n/intl_*.arb
Languages: ar, fr, ur

# contains
source: The text should contain {res}
ar: يجب أن يحتوي النص على {res}
fr: Le texte doit contenir {res}
ur: متن پر مشتمل ہونا چاہئے {res}

# containsItem
source: The list should contain {res}
ar: يجب أن تحتوي القائمة على {res}
fr: La liste doit contenir {res}
ur: فہرست پر مشتمل ہونا چاہئے {res}

# endsWith
source: Text should end with {res}
ar: يجب أن ينتهي النص بـ {res}
fr: Le texte doit se terminer par {res}
ur: متن کے ساتھ ختم ہونا چاہئے {res}

# equal
source: Only the value {value} is allowed.
ar: لا يسمح إلا بالقيمة {value}
fr: Seule la valeur {value} est autorisée.
ur: صرف قدر {value} کی اجازت ہے۔

# greaterThan
source: The value should be greater than {min}.
ar: يجب أن تكون القيمة أكبر من {min}.
fr: La valeur doit être supérieure à, {equal, select, true {ou égal à} autre{} other{}} {min}
ur: قیمت سے زیادہ ہونا چاہئے, {equal, select, true {یا برابر} دیگر{} other{}} {min}

# greaterThanOrEqual
source: The value should be greater than or equal {min}.
ar: يجب أن تكون القيمة أكبر من أو مساوية ل {min}.

# hasLength
source: You must enter a text of {length} characters
ar: يجب عليك إدخال نص مكون من {length} حرف
fr: Vous devez saisir un texte de {length} caractères
ur: آپ کو {length} حروف کا متن درج کرنا ہوگا۔

# hasMaxLength
source: The text must be no longer than {max}
ar: يجب ألا يزيد النص عن {max}
fr: Le texte ne doit pas dépasser {max}
ur: متن {max} سے زیادہ نہیں ہونا چاہیے

# hasMinLength
source: The length of the text must be at least {min}
ar: يجب أن يكون طول النص على الأقل {min}
fr: La longueur du texte doit être d'au moins {min}
ur: متن کی لمبائی کم از کم {min} ہونی چاہیے

# hasRange
source: You must enter a text of length not less than {min} and not more than {max}
ar: يجب إدخال نص بطول لا يقل عن {min} ولا يزيد عن {max}
fr: Vous devez saisir un texte d'une longueur non inférieure à {min} et non supérieure à {max}
ur: آپ کو طوالت کا متن درج کرنا چاہیے جو {min} سے کم نہ ہو اور {max} سے زیادہ نہ ہو۔

# invalidAngelCompanyUrl
source: Sorry! you have to enter a valid angel company {company, select, _{url} other{with name: {company}}}.
ar: آسف! يجب عليك إدخال رابط صحيح لشركة {company, select, empty{} other{{company}}} بموقع angel.
fr: Pardon! vous devez entrer une société providentielle valide {company, select, _{ url } other{ avec nom: {company}}} .
ur: معذرت! آپ کو ایک درست فرشتہ کمپنی درج کرنی ہوگی {company, select, _{ url } other{ name: {company}}} کے ساتھ۔

# invalidAngelJobUrl
source: Sorry! you have to enter a valid angel job {jobId, select, _{url} other{with id: {jobId}}}.
ar: آسف! عليك إدخال رابط صحيح لوظيفة {jobId, select, empty{} other{ تحمل المعرف : {jobId}}} بموقع angel.
fr: Pardon! vous devez saisir un job providentiel valide {jobId, select, _{ url } other{ avec identifiant: {jobId}}} .
ur: معذرت! آپ کو ایک درست فرشتہ جاب درج کرنا ہوگا {jobId, select, _{ url } other{ id کے ساتھ: {jobId}}} ۔

# invalidCrunchbaseOrganizationUrl
source: Sorry! you have to enter a valid crunchbase organization {organization, select, _{url} other{with name: {organization}}}.
ar: آسف! يجب عليك إدخال منظمة crunchbase صالحة {organization, select, empty{ url } other{ بالاسم: {organization}}} بموقع crunchbase.
fr: Pardon! vous devez entrer une organisation crunchbase valide {organization, select, _{ url } other{ avec nom: {organization}}} .
ur: معذرت! آپ کو ایک درست کرنچبیس تنظیم {organization, select, _{ url } other{ نام کے ساتھ درج کرنا ہوگا: {organization}}} ۔

# invalidCrunchbasePersonUrl
source: Sorry! you have to enter a valid crunchbase person {person, select, _{url} other{with name: {person}}}.
ar: آسف! يجب عليك إدخال شخص crunchbase صالح {person, select, empty{ url } other{ بالاسم: {person}}} بموقع crunchbase.
fr: Pardon! vous devez entrer une personne crunchbase valide {person, select, _{ url } other{ avec nom: {person}}} .
ur: معذرت! آپ کو ایک درست crunchbase person {person, select, _{ url } other{ نام کے ساتھ: {person}}} درج کرنا ہوگا۔

# invalidFacebookUrl
source: Sorry! you have to enter a valid facebook {name, select, _{{id, select, _{url} other{user with id: {id}}}} other{user with name: {name}}}.
ar: آسف! يجب عليك إدخال رابط {name, select, empty{{id, select, empty{ url } other{ للمستخدم الذي يحمل المعرف: {id}}}} other{ user للمستخدم: {name}}} بموقع facebook.
fr: Pardon! vous devez entrer un {name, select, _{{id, select, _{ url } other{ user avec identifiant: {id}}}} other{ user avec nom: {name}}} .
ur: معذرت! آپ کو ایک درست facebook {name, select, _{{id, select, _{ url } other{ user آئی ڈی کے ساتھ: {id}}}} other{ user نام کے ساتھ: {name}}} کرنا ہوگا۔

# invalidGitHubUrl
source: Sorry! you have to enter a valid gitHub {user, select, _{{repository, select, _{url} other{repository: {repository}}}} other{user with name: {user} {repository, select, _{} other{and repository: {repository}}}}}.
ar: آسف! يجب عليك إدخال رابط {user, select, empty{{repository, select, empty{ } other{ للمستودع: {repository}}}} other{ للمستخدم: {user} {repository, select, empty{} other{ : {repository}}}}} بموقع gitHub.
fr: Pardon! vous devez saisir un gitHub {user, select, _{{repository, select, _{ url } other{ repository: {repository}}}} other{ user avec nom: {user} {repository, select, _{} other{ et dépôt : {repository}}}}} .
ur: معذرت! آپ کو ایک درست gitHub {user, select, _{{repository, select, _{ url } other{ repository: {repository}}}} other{ user نام کے ساتھ: {user} {repository, select, _{} other{ درج کرنا ہوگا۔ {repository, select, _{} other{ اور repository: {repository}}}}} ۔

# invalidGooglePlusUrl
source: Sorry! you have to enter a valid google plus {userName, select, _{url} other{with user name: {userName}}}.
ar: آسف! يجب عليك إدخال رابط {userName, select, empty{ لمستخدم } other{ للمستخدم: {userName}}} بموقع google.
fr: Pardon! vous devez entrer un google plus valide {userName, select, _{ url } other{ avec le nom d'utilisateur : {userName}}} .
ur: معذرت! آپ کو ایک درست گوگل پلس درج کرنا ہوگا {userName, select, _{ url } other{ صارف نام کے ساتھ: {userName}}} ۔

# invalidHackerNewsItemUrl
source: Sorry! you have to enter a valid hacker news item {id, select, _{url} other{with id: {id}}}.
ar: آسف! يجب عليك إدخال رابط {id, select, empty{ لخبر } other{للخبر الذي يحمل المعرف: {id}}} بموقع HackerNews.
fr: Pardon! vous devez saisir un article de hacker valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست ہیکر نیوز آئٹم درج کرنا ہوگا {id, select, _{ url } other{ id کے ساتھ: {id}}} ۔

# invalidHackerNewsUserUrl
source: Sorry! you have to enter a valid hacker news user {id, select, _{url} other{with id: {id}}}.
ar: آسف! يجب عليك إدخال رابط {id, select, empty{ لمستخدم } other{ للمستخدم الذي يحمل المعرف: {id}}} بموقع HackerNews.
fr: Pardon! vous devez saisir un utilisateur de hacker news valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست ہیکر نیوز صارف {id, select, _{ url } other{ id کے ساتھ درج کرنا ہوگا: {id}}} ۔

# invalidInstagramUrl
source: Sorry! you have to enter a valid instagram {user, select, _{url} other{with user: {user}}}.
ar: آسف! يجب عليك إدخال رابط {user, select, empty{ لمستخدم } other{ للمستخدم: {user}}} بموقع instagram.
fr: Pardon! vous devez entrer un instagram valide {user, select, _{ url } other{ avec l'utilisateur: {user}}} .
ur: معذرت! آپ کو ایک درست انسٹاگرام درج کرنا ہوگا {user, select, _{ url } other{ user: {user}}} کے ساتھ۔

# invalidLinkedInCompanyUrl
source: Sorry! you have to enter a valid inked in {permalink, select, _{company url} other{company with {permalink} url}}.
ar: آسف! يجب عليك إدخال رابط {permalink, select, empty{لشركة} other{للشركة التي تحمل المعرف {permalink} }} بموقع linkedIn.
fr: Pardon! vous devez entrer un lien valide dans l'url de l'entreprise. {permalink}
ur: معذرت! آپ کو کمپنی کے یو آر ایل میں ایک درست لنک درج کرنا ہوگا۔ {permalink}

# invalidLinkedInPostUrl
source: Sorry! you have to enter a valid linked in post {id, select, _{url} other{with id: {id}}}
ar: آسف! يجب عليك إدخال رابط {id, select, empty{ لمنشور} other{ للمنشور الذي يحمل المعرف: {id}}} بموقع linkedIn.
fr: Pardon! vous devez saisir un lien valide dans la publication {id, select, _{ url } other{ avec identifiant: {id}}}
ur: معذرت! آپ کو پوسٹ {id, select, _{ url } other{ id کے ساتھ ایک درست لنک درج کرنا ہوگا: {id}}}

# invalidLinkedInProfileUrl
source: Sorry! you have to enter a valid inked in {permalink, select, _{profile url} other{profile with {permalink} url}}.
ar: آسف! يجب عليك إدخال رابط {permalink,select,empty{لملف شخصي} other{للملف الشخصي الذي يحمل المعرف {permalink}}} بموقع linkedIn.
fr: Pardon! vous devez saisir une URL de profil liée valide. {permalink}
ur: معذرت! آپ کو پروفائل یو آر ایل میں ایک درست لنک درج کرنا ہوگا۔ {permalink}

# invalidMediumPostUrl
source: Sorry! you have to enter a valid medium post {postId, select, _{url} other{with id: {postId}}}.
ar: آسف! يجب عليك إدخال رابط {postId, select, empty{ لمنشور } other{ للمنشور الذي يحمل المعرف: {postId}}} بموقع medium.
fr: Pardon! vous devez saisir une publication de support valide {postId, select, _{ url } other{ avec identifiant: {postId}}} .
ur: معذرت! آپ کو id کے ساتھ ایک درست میڈیم پوسٹ {postId, select, _{ url } other{ درج کرنا ہوگا: {postId}}} ۔

# invalidMediumUserUrl
source: Sorry! you have to enter a valid medium user {userName, select, _{{id, select, _{url} other{with id: {id}}}} other{with user name: {userName}}}.
ar: آسف! يجب عليك إدخال رابط {userName, select, empty{{id, select, empty{ url } other{ للمستخدم الذي يحمل المعرف: {id}}}} other{ للمستخدم: {userName}}} بموقع medium.
fr: Pardon! vous devez saisir un utilisateur de support valide {userName, select, _{{id, select, _{ url } other{ avec identifiant: {id}}}} other{ avec l'utilisateur name: {userName}}} .
ur: معذرت! آپ کو ایک درست میڈیم صارف درج کرنا ہوگا {userName, select, _{{id, select, _{ url } other{ id کے ساتھ: {id}}}} other{ user name: {userName}}} کے ساتھ۔

# invalidRedditUrl
source: Sorry! you have to enter a valid reddit {user, select, _{url} other{with user: {user}}}.
ar: آسف! يجب عليك إدخال رابط {user, select, empty{ } other{ للمستخدم: {user}}} بموقع reddit.
fr: Pardon! vous devez entrer un reddit valide {user, select, _{ url } other{ avec l'utilisateur: {user}}} .
ur: معذرت! آپ کو ایک درست reddit درج کرنا ہوگا {user, select, _{ url } other{ user: {user}}} کے ساتھ۔

# invalidSnapchatUrl
source: Sorry! you have to enter a valid snapchat {user, select, _{url} other{with user: {user}}}.
ar: آسف! يجب عليك إدخال snapchat صالح {user, select, empty{ url } other{ with user: {user}}} بموقع medium.
fr: Pardon! vous devez saisir un snapchat valide {user, select, _{ url } other{ avec l'utilisateur: {user}}} .
ur: معذرت! آپ کو ایک درست اسنیپ چیٹ درج کرنا ہوگا {user, select, _{ url } other{ user: {user}}} کے ساتھ۔

# invalidStackexchangeUrl
source: Sorry! you have to enter a valid stackexchange {user, select, _{{id, select, _{url} other{with id: {id}}}} other{with user name: {user}}}.
ar: آسف! يجب عليك إدخال رابط {user, select, empty{{id, select, empty{ } other{ بالمعرف: {id}}}} other{ مع اسم المستخدم: {user}}} بموقع stackexchange.
fr: Pardon! vous devez entrer un stackexchange valide {user, select, _{{id, select, _{ url } other{ avec identifiant: {id}}}} other{ avec l'utilisateur name: {user}}} .
ur: معذرت! آپ کو ایک درست stackexchange درج کرنا ہوگا {user, select, _{{id, select, _{ url } other{ id کے ساتھ: {id}}}} other{ user name: {user}}} کے ساتھ۔

# invalidStackoverflowQuestionUrl
source: Sorry! you have to enter a valid stackoverflow question {id, select, _{url} other{with id: {id}}}.
ar: آسف! يجب عليك إدخال رابط {id, select, empty{ لسؤال } other{ للسؤال الذي يحمل المعرف: {id}}} بموقع stackoverflow.
fr: Pardon! vous devez saisir une question stackoverflow valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست اسٹیک اوور فلو سوال درج کرنا ہوگا {id, select, _{ url } other{ id کے ساتھ: {id}}} ۔

# invalidStackoverflowUserUrl
source: Sorry! you have to enter a valid stackoverflow user {id, select, _{url} other{with id: {id}}}.
ar: آسف! يجب عليك إدخال رابط {id, select, empty{ لمستخدم } other{ للمستخدم الذي يحمل المعرف: {id}}} بموقع stackoverflow.
fr: Pardon! vous devez entrer un utilisateur stackoverflow valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست اسٹیک اوور فلو صارف {id, select, _{ url } other{ id: {id}}} کے ساتھ درج کرنا ہوگا۔

# invalidTelegramProfileUrl
source: Sorry! you have to enter a valid telegram profile {userName, select, _{url} other{with user name: {userName}}}.
ar: آسف! يجب عليك إدخال رابط {userName, select, empty{ لملف شخصي } other{ لملف المستخدم: {userName}}} بموقع telegram.
fr: Pardon! vous devez entrer un profil de télégramme valide {userName, select, _{ url } other{ avec le nom d'utilisateur : {userName}}} .
ur: معذرت! آپ کو ایک درست ٹیلیگرام پروفائل درج کرنا ہوگا {userName, select, _{ url } other{ صارف نام کے ساتھ: {userName}}} ۔

# invalidTwitterStatusUrl
source: Sorry! you have to enter a valid twitter status {tweetId, select, _{url} other{with id: {tweetId}}} {userName, select, _{} other{with user name: {userName}}}.
ar: آسف! يجب عليك إدخال رابط {tweetId, select, empty{ لتغريدة } other{ للتغريدة التي تحمل المعرف: {tweetId}}} {userName, select, empty{} other{ بإسم: {userName}}} بموقع twitter.
fr: Pardon! vous devez saisir un statut Twitter valide {tweetId, select, _{ url } other{ avec identifiant: {tweetId}}} {userName, select, _{} other{ avec l'utilisateur name: {userName}}} .
ur: معذرت! آپ کو ایک درست ٹویٹر اسٹیٹس درج کرنا ہوگا {tweetId, select, _{ url } other{ id کے ساتھ: {tweetId}}} {userName, select, _{} other{ user name: {userName}}} کے ساتھ۔

# invalidTwitterUserUrl
source: Sorry! you have to enter a valid twitter user {userName, select, _{url} other{with user name: {userName}}}.
ar: آسف! يجب عليك إدخال رابط {userName, select, empty{ لمستخدم } other{ للمستخدم: {userName}}} بموقع twitter.
fr: Pardon! vous devez saisir un utilisateur Twitter valide {userName, select, _{ url } other{ avec l'utilisateur name: {userName}}} .
ur: معذرت! آپ کو ایک درست ٹویٹر صارف {userName, select, _{ url } other{ صارف نام کے ساتھ درج کرنا ہوگا: {userName}}} ۔

# invalidYoutubeChannelUrl
source: Sorry! you have to enter a valid youtube channel {id, select, _{url} other{with id: {id}}}.
ar: آسف! عليك إدخال رابط {id, select, empty{ لقناة } other{للقناة التي تحمل المعرف: {id}}} بموقع youtube.
fr: Pardon! vous devez saisir une chaîne youtube valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست یوٹیوب چینل {id, select, _{ url } other{ id: {id}}} کے ساتھ درج کرنا ہوگا۔

# invalidYoutubeUserUrl
source: Sorry! you have to enter a valid youtube user {userName, select, _{url} other{with user name: {userName}}}.
ar: آسف! عليك إدخال رابط {userName, select, empty{ لمستخدم } other{ للمستخدم: {userName}}} بموقع youtube.
fr: Pardon! vous devez saisir un utilisateur youtube valide {userName, select, _{ url } other{ avec l'utilisateur name: {userName}}} .
ur: معذرت! آپ کو ایک درست یوٹیوب صارف {userName, select, _{ url } other{ صارف کے نام کے ساتھ درج کرنا ہوگا: {userName}}} ۔

# invalidYoutubeVideoUrl
source: Sorry! you have to enter a valid youtube video {id, select, _{url} other{with id: {id}}}.
ar: آسف! عليك إدخال رابط {id, select, empty{لفيديو } other{ للفيديو الذي يحمل المعرف: {id}}} بموقع youtube.
fr: Pardon! vous devez entrer une vidéo youtube valide {id, select, _{ url } other{ avec identifiant: {id}}} .
ur: معذرت! آپ کو ایک درست یوٹیوب ویڈیو {id, select, _{ url } other{ id: {id}}} کے ساتھ درج کرنا ہوگا۔

# isBetween
source: Value must be greater than {min} and less than {max}
ar: يجب أن تكون القيمة أكبر من {min} وأقل من {max}
fr: La valeur doit être {min}supérieure et inférieure à {max}{equal, select, true {ou égal} other{}}
ur: قیمت {min}{max}{equal, select, true {یا برابر} other{}} سے زیادہ اور کم ہونا ضروری ہے

# isBetweenOrEqual
source: Value must be greater than or equal {min} and less than or equal {max}
ar: يجب أن تكون القيمة أكبر من أو تساوي {min} وأقل من أو تساوي {max}

# isCreditCard
source: You must enter a valid credit card number
ar: يجب إدخال رقم بطاقة ائتمان صالح
fr: Vous devez entrer le numéro de carte de crédit
ur: آپ کو ایک درست کریڈٹ کارڈ نمبر درج کرنا ہوگا

# isDateAfter
source: You must enter a date after {other}.
ar: يجب عليك إدخال تاريخ لاحق ل {o}.
fr: Vous devez entrer une date après {other}, {equal, select, true {ou égal à} other{}}
ur: آپ کو {other} کے بعد کی تاریخ درج کرنی ہوگی, {equal, select, true {یا برابر} other{}}

# isDateAfterOrEqual
source: You must enter a date after or at the same time as {other}.
ar: يجب إدخال تاريخ لاحق أو في نفس الوقت {o}.

# isDateBefore
source: You must enter a date before {other}.
ar: يجب إدخال تاريخ سابق ل {o}.
fr: Vous devez entrer une date avant le {other}, {equal, select, true {ou égal à} other{}}
ur: آپ کو {other} سے پہلے کی تاریخ درج کرنی ہوگی, {equal, select, true {یا اس کے برابر} other{}}

# isDateBeforeOrEqual
source: You must enter a date before or at the same time as {other}.
ar: يجب إدخال تاريخ سابق أو في نفس الوقت {o}.

# isDateBetween
source: You must enter a date between {min} and {max}.
ar: يجب عليك إدخال تاريخ بين {min} و{max}.
fr: Vous devez entrer une date entre {min} et {max}, {equal, select, true{ou égal à un} other{}}
ur: آپ کو {min} اور {max} کے درمیان تاریخ درج کرنی ہوگی, {equal, select, true {یا ایک کے برابر} other{}}

# isDateBetweenOrEqual
source: You must enter a date between {min} and {max} or at the same time as any of them.
ar: يجب عليك إدخال تاريخ بين {min} و {max} أو في نفس وقت أي منها

# isDateTime
source: You must enter a valid date
ar: يجب إدخال تاريخ صالح
fr: Vous devez entrer une date valide
ur: آپ کو ایک درست تاریخ درج کرنی ہوگی۔

# isDecimal
source: You must enter a decimal number
ar: يجب إدخال رقم عشري
fr: Vous devez entrer un nombre décimal
ur: آپ کو اعشاریہ نمبر درج کرنا ہوگا۔

# isDivisibleBy
source: The input value must be divisible by {division}
ar: يجب أن تكون قيمة الإدخال قابلة للقسمة {division}
fr: La valeur d'entrée doit être divisible par {division}
ur: ان پٹ ویلیو کی طرف سے تقسیم ہونا ضروری ہے {division}

# isEmail
source: You must enter a valid email address
ar: يجب إدخال عنوان بريد إلكتروني صالح
fr: Vous devez entrer un email valide
ur: آپ کو ایک درست ای میل درج کرنا ہوگی۔

# isEven
source: The value must be an even number
ar: يجب أن تكون القيمة رقمًا زوجي.
fr: La valeur doit être un nombre pair
ur: قدر ایک بھی عدد ہونا ضروری ہے

# isIn
source: The entered value must be one of the {list}
ar: يجب أن تكون القيمة المدخلة واحدة من {list}
fr: La valeur saisie doit faire partie de la {liste}
ur: درج کردہ قدر {list} میں سے ایک ہونی چاہیے

# isInteger
source: You must enter a valid number
ar: يجب إدخال رقم صحيح
fr: Vous devez saisir un numéro valide
ur: آپ کو ایک درست نمبر درج کرنا ہوگا۔

# isNegative
source: Value must be negative
ar: يجب أن تكون القيمة سالبة
fr: La valeur doit être négative
ur: قدر منفی ہونا ضروری ہے

# isNotIn
source: The entered value must not be in {list}
ar: يجب ألا تكون القيمة المدخلة في {list}
fr: La valeur saisie ne doit pas être dans {list}
ur: درج کردہ قدر {list} میں نہیں ہونی چاہیے

# isNumber
source: You must enter a valid number
ar: يجب إدخال رقم صالح
fr: Vous devez saisir un numéro valide
ur: آپ کو ایک درست نمبر درج کرنا ہوگا۔

# isOdd
source: The value must be an odd number
ar: يجب أن تكون القيمة رقمًا فرديًا
fr: La valeur doit être un nombre impair
ur: قدر ایک عجیب عدد ہونا ضروری ہے

# isPositive
source: The value should be positive
ar: يجب أن تكون القيمة موجبة.
fr: La valeur doit être positive
ur: قدر مثبت ہونا چاہئے

# isTimeAfter
source: You must enter a date after {other}.
ar: يجب عليك إدخال وقت لاحق ل {o}.
fr: Vous devez saisir une heure après {other}, {equal, select, true {ou égal à} other{}}
ur: آپ کو {other} کے بعد کا وقت درج کرنا ہوگا, {equal, select, true {یا برابر} other{}}

# isTimeAfterOrEqual
source: You must enter time after or at the same time as {other}.
ar: يجب إدخال وقت لاحق أو في نفس الوقت {o}.

# isTimeBefore
source: You must enter time before {other}.
ar: يجب عليك إدخال وقت سابق ل {o}.
fr: Vous devez saisir une heure avant {other}, {equal, select, true {ou égal à} other{}}
ur: آپ کو {other} سے پہلے کا وقت درج کرنا ہوگا, {equal, select, true {یا اس کے برابر} other{}}

# isTimeBeforeOrEqual
source: You must enter time before or at the same time as {other}.
ar: يجب إدخال وقت سابق أو في نفس الوقت {o}.

# isTimeBetween
source: You must enter time between {min} and {max}.
ar: يجب عليك إدخال وقت بين {min} و{max}.
fr: Vous devez saisir un temps compris entre {min} et {max}, {equal, select, true{ou égal à un} other{}}
ur: آپ کو {min} اور {max} کے درمیان وقت درج کرنا ہوگا, {equal, select, true {یا ایک کے برابر} other{}}

# isTimeBetweenOrEqual
source: You must enter time between {min} and {max} or at the same time any of them
ar: يجب عليك إدخال وقت بين {min} و {max} أو في نفس وقت أي منها

# isTimeOfDay
source: You must enter a valid time
ar: يجب إدخال وقت صحيح
fr: Vous devez saisir une heure valide
ur: آپ کو ایک درست وقت درج کرنا ہوگا۔

# lessThan
source: Value must be less than {max}.
ar: يجب أن تكون القيمة أقل من {max}.
fr: La valeur doit être inférieure à, {equal, select, true {ou égal à} autre{} other{}} {max}
ur: قیمت سے کم ہونا ضروری ہے, {equal, select, true {یا برابر} دیگر{} other{}} {max}

# lessThanOrEqual
source: Value must be less than or equal {max}.
ar: يجب أن تكون القيمة أقل من أو تساوي {max}.

# listHasLength
source: The number of elements must equal {length}
ar: يجب أن يساوي عدد العناصر {length}
fr: Le nombre d'éléments doit être égal à {length}
ur: عناصر کی تعداد {length} کے برابر ہونی چاہیے

# listMaxLength
source: The number of elements should not be more than {max}
ar: يجب ألا يزيد عدد العناصر عن {max}
fr: Le nombre d'articles ne doit pas dépasser {max}
ur: اشیاء کی تعداد سے زیادہ نہیں ہونا چاہئے {max}

# listMinLength
source: The number of elements should not be less than {max}
ar: يجب ألا يقل عدد العناصر عن {min}
fr: Le nombre d'articles ne doit pas être inférieur à {min}
ur: اشیاء کی تعداد سے کم نہیں ہونا چاہئے {min}

# listRange
source: The number of elements must be between {min} and {max}
ar: يجب أن يكون عدد العناصر بين {min} و {max}
fr: Le nombre d'articles doit être d'au moins {min}et pas plus de {max}
ur: اشیاء کی تعداد کم از کم {min}اور اس سے زیادہ نہیں ہونا چاہئے {max}

# notContainsItem
source: The list should not to contain {res}
ar: يجب ألا تحتوي القائمة على {res}
fr: La liste ne doit pas nécessairement contenir {res}
ur: فہرست پر مشتمل نہیں ہے {res}

# notEmpty
source: You should not enter an empty value
ar: يجب عدم إدخال قيمة فارغة
fr: Une valeur vide ne doit pas être saisie
ur: خالی قیمت درج نہیں کی جانی چاہئے۔

# notEqual
source: Not allowed to enter {value}
ar: غير مسموح بإدخال {value}
fr: Non autorisé à entrer {value}
ur: {value} میں داخل ہونے کی اجازت نہیں ہے

# regexp
source: The requested format is not compatible with the input
ar: التنسيق المطلوب غير متوافق مع المدخلات
fr: Le format demandé n’est pas compatible avec l’entrée
ur: درخواست کردہ وضع ان پٹ سے مطابقت نہیں رکھتی

# required
source: Excuse me! This field is required
ar: عفوا! هذا الحقل مطلوب
fr: Excuse-moi! Ce champ est requis
ur: معاف کیجئے گا! اس کو پر کرنا ضروری ہے

# startsWith
source: Text should start with {res}
ar: يجب أن يبدأ النص ب {res}
fr: Le texte doit commencer par {res}
ur: متن کے ساتھ شروع کرنا چاہئے {res}
